<?php
// +----------------------------------------------------------------------
// | AcShop (Acgice商城)
// +----------------------------------------------------------------------
// | 团队官网: https://oauth.acgice.com
// +----------------------------------------------------------------------
// | 联系我们: https://oauth.acgice.com/sdk/contact.html
// +----------------------------------------------------------------------
// | gitee开源项目：https://gitee.com/orzice/ac-shop
// +----------------------------------------------------------------------
// | Author：Orzice(小涛)  https://gitee.com/orzice
// +----------------------------------------------------------------------
// | DateTime：2020-10-14 11:24:38
// +----------------------------------------------------------------------

use think\facade\Config;
use think\facade\Event;


return function () {
   print_r("插件B启动<br>");
	// 设置插件
	Config::set(['b' => ''], 'plugins_menu');

	// 监听事件
	Event::subscribe(AcShop\plugin\b\listener\index::class);
	


};
